src/test/resources/mapper/mapping/data/10_source.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <ns3:MessageHeader xmlns:ns3="http://www.shaw.ca/ns/schema/shared/v1"
                           xmlns="http://www.shaw.ca/ns/schema/content/catalogchannellineup/v1"
                           xmlns:ns2="http://cableapi.cablelabs.com/schemas/v2">
            <ns3:CreatedDatetime>2022-07-14T17:01:27.393-04:00</ns3:CreatedDatetime>
            <ns3:OriginatingUser>SJRB\svcdev_oe2</ns3:OriginatingUser>
            <ns3:OriginatingSystem>Shaw Trial</ns3:OriginatingSystem>
            <ns3:ServiceOrchestrationTransactionId>9164073320013595587</ns3:ServiceOrchestrationTransactionId>
        </ns3:MessageHeader>
    </soap:Header>
    <soap:Body>
        <FindChannelLineupRequest xmlns="http://www.shaw.ca/ns/schema/content/catalogchannellineup/v1"
                                  xmlns:ns2="http://cableapi.cablelabs.com/schemas/v2"
                                  xmlns:ns3="http://www.shaw.ca/ns/schema/shared/v1">
            <searchCriteria>
                <geographicLocations>
                    <geographicLocation>
                        <ns2:geographicLocation>
                            <ns2:administrativeArea>
                                <ns2:type>Branch</ns2:type>
                                <ns2:name>VAN</ns2:name>
                            </ns2:administrativeArea>
                        </ns2:geographicLocation>
                    </geographicLocation>
                    <geographicLocation>
                        <ns2:geographicLocation>
                            <ns2:administrativeArea>
                                <ns2:type>Report Code</ns2:type>
                                <ns2:name>2</ns2:name>
                            </ns2:administrativeArea>
                        </ns2:geographicLocation>
                    </geographicLocation>
                </geographicLocations>
                <attributeValuePairs>
                    <attributeValuePair>
                        <ns2:attributeName>Business Segment</ns2:attributeName>
                        <ns2:attributeValue>Cable</ns2:attributeValue>
                    </attributeValuePair>
                </attributeValuePairs>
                <types>
                    <type xmlns:xs="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                          xsi:type="xs:string">LEGACY</type>
                    <type xmlns:xs="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                          xsi:type="xs:string">FLEX</type>
                    <type xmlns:xs="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                          xsi:type="xs:string">NGV</type>
                </types>
            </searchCriteria>
        </FindChannelLineupRequest>
    </soap:Body>
</soap:Envelope>